---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarContainer.Contains(Autodesk.Revit.DB.Structure.RebarContainerItem)
source: html/ed75fef3-8c01-c440-a1ca-db20914712fa.htm
---
# Autodesk.Revit.DB.Structure.RebarContainer.Contains Method

Checks if the RebarContainer has this item as one of its members.

## Syntax (C#)
```csharp
public bool Contains(
	RebarContainerItem pItem
)
```

## Parameters
- **pItem** (`Autodesk.Revit.DB.Structure.RebarContainerItem`) - The item to be checked if RebarContainer has it as one of its members

## Returns
True if RebarContainer has this item as one of its members, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null